# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages
#+TITLE:       Laboratory Notebook for a Multi-Threaded Version of Quicksort
#+AUTHOR:      Arnaud Legrand
#+LANGUAGE:    en
#+TAGS: IMPORTANT(i) TEST(t) DEPRECATED(d) noexport(n)

** data/
This is where raw experimental data should go. Each directory entry
comprises a set of experiments and the directory name is based on the
machine name and on the date. For example:
#+begin_src sh :results output :exports both
echo mkdir data/`hostname`_`date +%F`
#+end_src

#+RESULTS:
: mkdir data/sama_2014-10-13

** Compilation
A simple makefile with various compilation options is provided in the
src/ directory. Compilation is thus done by running the following command:
#+begin_src sh :results output :exports both
make -C src/
#+end_src

#+RESULTS:
: make: Entering directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  -c -o parallelQuicksort.o parallelQuicksort.c
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  parallelQuicksort.o  -o parallelQuicksort
: make: Leaving directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'

*** Initial code design
- I obtained an initial implementation from
  http://sc12.supercomputing.org/hpceducator/PythonForParallelism/codes/parallelQuicksort.c.
  According to the header, the original author is Joshua Stough from
  Washington and Lee University. I hope he will not mind that I reuse
  this piece of code for educational purposes.
- Here is a typical first execution on my laptop (an Intel(R) Core(TM)
  i7 running a Debian with Linux 3.14.15):
  #+begin_src sh :results output :exports both
    ./src/quicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.231571 sec.
  : at loc 506315, 5.068226e-01 < 5.068269e-01
  : Oops, lyst did not get sorted by parallelQuicksort.
  : Parallel quicksort took: 0.161259 sec.
  : Built-in qsort took: 0.241568 sec.

  Sweet, in my first attempt, it looks like this parallel version is
  indeed running faster than then sequential one. I have to say this
  warning message is stressing me a bit though.
- On smaller instances, the code would segfault. So I reindented the
  code and thanks to valgrind and gdb, I could find what was wrong. I
  also renamed the file so that compiling is more convenient. This
  fixed the previous warning message so now everything seems fine:
  #+begin_src sh :results output :exports both
    ./src/parallelQuicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.239347 sec.
  : Parallel quicksort took: 0.176365 sec.
  : Built-in quicksort took: 0.244716 sec.

*** Initial code install
- I obtained the code by cloning Arnaud Legrand's git repo at github in my local machine,
  as part of the SMPE/UFRGS course exercise.
  https://github.com/alegrand/M2R-ParallelQuicksort
- I'll run the experiments on my laptop, a Late 2008 MacBook
  Pro. System Overview

   #+BEGIN_SRC sh :results output
   uname -a
   #+End_SRC

   #+RESULTS:
   : Darwin Julianos-MacBook-Pro.local 14.5.0 Darwin Kernel Version 14.5.0: Wed Jul 29 02:26:53 PDT 2015; root:xnu-2782.40.9~1/RELEASE_X86_64 x86_64

   #+BEGIN_SRC sh :results output
   sw_vers
   #+END_SRC

   #+RESULTS:
   : ProductName:	Mac OS X
   : ProductVersion:	10.10.5
   : BuildVersion:	14F27

   #+BEGIN_SRC sh :results output
     system_profiler SPHardwareDataType
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Hardware:

       Hardware Overview:

         Model Name: MacBook Pro
         Model Identifier: MacBookPro5,1
         Processor Name: Intel Core 2 Duo
         Processor Speed: 2,4 GHz
         Number of Processors: 1
         Total Number of Cores: 2
         L2 Cache: 3 MB
         Memory: 8 GB
         Bus Speed: 1,07 GHz
         Boot ROM Version: MBP51.007E.B00
         SMC Version (system): 1.41f2
         Serial Number (system): W89203HD8Q1
         Hardware UUID: 8406B003-DA62-5F30-BF66-69D863570F45
         Sudden Motion Sensor:
             State: Enabled

#+end_example


- Since I've recently reinstalled my OS, I needed to reinstall Xcode 5
  and Xcode command line tools:

  #+BEGIN_SRC
  xcode-select --install
  #+END_SRC


- First step was to take to compile the code in my machine. But when I
  ran make got a complaining about librt.

   #+BEGIN_SRC sh :results output :export both
     make -C src
   #+End_SRC

   #+RESULTS:
   : clang:   warning: argument unused during compilation: '-pthread'
   : ld:      library not found for -lrt
   : clang: error: linker command failed with exit code 1 (use -v to see invocation)
   : make: *** [parallelQuicksort] Error 1

- Removed the librt from CFLAGS in the Makefile and tried to compile
  again. Apparently everything went smootly. Hope things don't start segfaulting.

  #+BEGIN_SRC sh :results output
    make -C src
  #+END_SRC

  #+RESULTS:
  : cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread  -std=c99 parallelQuicksort.o  -o parallelQuicksort

- I've tried to run the code. Aparently things went ok, with the
  parallel verions running slithly faster. Considering that I have a 2
  core machine, I didn't expected a lot of improvment.

   #+begin_src sh :results output :exports both
     ./src/parallelQuicksort
   #+end_src

   #+RESULTS:
   : Sequential quicksort took: 0.437233 sec.
   : Parallel quicksort took: 0.494957 sec.
   : Built-in quicksort took: 0.559151 sec.

